zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/ccap_reg.h
     * |[10]    |WEN10     |Motion Detection Window 10 Enable Bit
     * |        |          |00 = Motion Detection Window 10 Disabled.
     * |        |          |01 = Motion Detection Window 10 Enabled only when CCAP_INTEN[5:4] (MDIEN) is not equal to 0x0.
     * |[11]    |WEN11     |Motion Detection Window 11 Enable Bit
     * |        |          |00 = Motion Detection Window 11 Disabled.
     * |        |          |01 = Motion Detection Window 11 Enabled only when CCAP_INTEN[5:4] (MDIEN) is not equal to 0x0.
     * |[12]    |WEN12     |Motion Detection Window 12 Enable Bit
     * |        |          |00 = Motion Detection Window 12 Disabled.
     * |        |          |01 = Motion Detection Window 12 Enabled only when CCAP_INTEN[5:4] (MDIEN) is not equal to 0x0.
     * |[13]    |WEN13     |Motion Detection Window 13 Enable Bit
     * |        |          |00 = Motion Detection Window 13 Disabled.
     * |        |          |01 = Motion Detection Window 13 Enabled only when CCAP_INTEN[5:4] (MDIEN) is not equal to 0x0.
     * |[14]    |WEN14     |Motion Detection Window 14 Enable Bit
     * |        |          |00 = Motion Detection Window 14 Disabled.
     * |        |          |01 = Motion Detection Window 14 Enabled only when CCAP_INTEN[5:4] (MDIEN) is not equal to 0x0.
     * |[15]    |WEN15     |Motion Detection Window 15 Enable Bit
     * |        |          |00 = Motion Detection Window 15 Disabled.
     * |        |          |01 = Motion Detection Window 15 Enabled only when CCAP_INTEN[5:4] (MDIEN) is not equal to 0x0.
     * @var CCAP_T::MDTRG_WK
     * Offset: 0x104  Motion Detection Trigger and Wakeup Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[1:0]   |TRGSEL    |Trigger Source Selection
     * |        |          |00 = LPTMR0.
     * |        |          |01 = LPTMR1.
     * |        |          |10 = TTMR0.
     * |        |          |11 = TTMR1.
     * |[16]    |WKEN      |Wake-up Function Enable Bit
     * |        |          |If this bit is set to 1, while Motion Detection Modes interrupt MDINTF (CCAP_INTSTS[5:4]) is 1 and MDIEN (CCAP_INTEN[5:4]) is enabled, the CCAP interrupt signal will generate a wake-up trigger event to CPU.
     * |        |          |0 = Wake-up function Disabled if CCAP interrupt signal generated.
     * |        |          |1 = Wake-up function Enabled if CCAP interrupt signal generated.
     * |[24]    |WKF       |CCAP Wake-up Flag
     * |        |          |This bit indicates the interrupt wake-up flag status of CCAP.
     * |        |          |0 = CCAP does not cause CPU wake-up.
     * |        |          |1 = CPU wake-up from Idle or Power-down mode if MDINTF (CCAP_INTSTS[5:4]) are generated.
     * |        |          |Note: This bit is cleared by writing 1 to it.
     * @var CCAP_T::MDTTH
     * Offset: 0x110  Motion Detection Total Threshold Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[20:0]  |MDTTH     |Motion Detection Total Threshold
     * |        |          |Specify the 21-bit threshold value for checking if the total SAD of all windows (CCAP_MDTSAD) is overflow
     * |        |          |Note: The maximum value of MDTSAD is 0x12AD40.
     * @var CCAP_T::MDTSAD
     * Offset: 0x114  Motion Detection Total SAD Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[20:0]  |MDTSAD    |Motion Detection Total SAD
     * |        |          |The total SAD (Sum of Absolute Differences) of all windows (i.e., CCAP_MDTSAD = CCAP_MDWSAD0 + CCAP_MDWSAD1 + CCAP_MDWSAD2 + CCAP_MDWSAD3 + CCAP_MDWSAD4 + CCAP_MDWSAD5 + CCAP_MDWSAD6 + CCAP_MDWSAD7 + CCAP_MDWSAD8 + CCAP_MDWSAD9 + CCAP_MDWSAD10 + CCAP_MDWSAD11 + CCAP_MDWSAD12 + CCAP_MDWSAD13 + CCAP_MDWSAD14 + CCAP_MDWSAD15).
     * |        |          |Note: The maximum value of MDTSAD is 0x12AD40.
     * @var CCAP_T::MDWOCTH
     * Offset: 0x120  Motion Detection Window Overflow Counter Threshold Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[3:0]   |MDWOCTH   |Motion Detection Window Overflow Counter threshold
     * |        |          |Specify the 4-bit threshold value for checking if CCAP_MDWOC is overflow.
     * @var CCAP_T::MDWOC
     * Offset: 0x124  Motion Detection Window Overflow Counter Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[4:0]   |MDWOC     |Motion Detection Window Overflow Counter
     * |        |          |The counter of windows that their CCAP_MDWSADx are larger than their CCAP_MDWTHx.
     * @var CCAP_T::MDWTH[16]
     * Offset: 0x140 ~ 0x17C  Motion Detection Window Threshold 0 ~ 15 Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[16:0]  |MDWTH     |Motion Detection Window Threshold
     * |        |          |Specify the 17-bit threshold value for checking if the SAD of window x (CCAP_MDWSADx) is overflow.
     * |        |          |Note: The maximum value of MDWSAD is 0x12AD4.
     * @var CCAP_T::MDWSAD[16]
     * Offset: 0x180 ~ 0x1BC  Motion Detection Window SAD 0 ~ 15 Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[16:0]  |MDWSAD    |Motion Detection Window SAD
     * |        |          |The 17-bit value for the SAD (Sum of Absolute Differences) of window x.
     * |        |          |Note: The maximum value of MDWSAD is 0x12AD4.
     */
    __IO uint32_t CTL;                   /*!< [0x0000] Camera Capture Interface Control Register                        */
    __IO uint32_t PAR;                   /*!< [0x0004] Camera Capture Interface Parameter Register                      */
    __IO uint32_t INTEN;                 /*!< [0x0008] Camera Capture Interface Interrupt Enable Register               */
    __IO uint32_t INTSTS;                /*!< [0x000c] Camera Capture Interface Interrupt Status Register               */
    __IO uint32_t PARM;                  /*!< [0x0010] Camera Capture Interface Parameter Register (MSB)                */
    __I  uint32_t RESERVE0[3];
    __IO uint32_t CWSP;                  /*!< [0x0020] Cropping Window Starting Address Register                        */
    __IO uint32_t CWS;                   /*!< [0x0024] Cropping Window Size Register                                    */
    __IO uint32_t PKTSL;                 /*!< [0x0028] Packet Scaling Vertical/Horizontal Factor Register (LSB)         */
    __IO uint32_t PLNSL;                 /*!< [0x002C] Planar Scaling Vertical/Horizontal Factor Register (LSB)         */
    __IO uint32_t FRCTL;                 /*!< [0x0030] Scaling Frame Rate Factor Register                               */
    __IO uint32_t STRIDE;                /*!< [0x0034] Frame Output Pixel Stride Width Register                         */
    __I  uint32_t RESERVE1[1];
    __IO uint32_t FIFOTH;                /*!< [0x003c] FIFO Threshold Register                                          */
    __IO uint32_t CMPADDR;               /*!< [0x0040] Compare Memory Base Address Register                             */
    __IO uint32_t LUMA_Y1_THD;           /*!< [0x0044] Luminance Y8 to Y1 Threshold Value Register                      */
    __IO uint32_t PKTSM;                 /*!< [0x0048] Packet Scaling Vertical/Horizontal Factor Register (MSB)         */
    __IO uint32_t PLNSM;                 /*!< [0x004C] Planar Scaling Vertical/Horizontal Factor Register (MSB)         */
    __I  uint32_t CURADDRP;              /*!< [0x0050] Current Packet System Memory Address Byte Counter Register       */
    __I  uint32_t CURADDRY;              /*!< [0x0054] Current Planar Y System Memory Address Register                  */
    __I  uint32_t CURADDRU;              /*!< [0x0058] Current Planar U System Memory Address Register                  */
    __I  uint32_t CURADDRV;              /*!< [0x005C] Current Planar V System Memory Address Register                  */
    __IO uint32_t PKTBA0;                /*!< [0x0060] System Memory Packet Base Address 0 Register                     */
    __I  uint32_t RESERVE2[7];
    __IO uint32_t YBA;                   /*!< [0x0080] System Memory Packet Base Address 0 Register                     */
    __IO uint32_t UBA;                   /*!< [0x0084] System Memory Packet Base Address 0 Register                     */
    __IO uint32_t VBA;                   /*!< [0x0088] System Memory Packet Base Address 0 Register                     */
    __I  uint32_t RESERVE3[29];
    __IO uint32_t MDCTL;                 /*!< [0x0100] Motion Detection Control Register                                */
    __IO uint32_t MDTRG_WK;              /*!< [0x0104] Motion Detection Trigger and Wakeup Register                     */
    __I  uint32_t RESERVE4[2];
    __IO uint32_t MDTTH;                 /*!< [0x0110] Motion Detection Total Threshold Register                        */
    __I  uint32_t MDTSAD;                /*!< [0x0114] Motion Detection Total SAD Register                              */
    __I  uint32_t RESERVE5[2];
    __IO uint32_t MDWOCTH;               /*!< [0x0120] Motion Detection Window Overflow Counter Threshold Register      */
    __I  uint32_t MDWOC;                 /*!< [0x0124] Motion Detection Window Overflow Counter Register                */
    __I  uint32_t RESERVE6[6];
    __IO uint32_t MDWTH[16];             /*!< [0x0140] ~ [0x017c] Motion Detection Window Threshold 0 ~ 15 Register      */
    __I  uint32_t MDWSAD[16];            /*!< [0x0180] ~ [0x01bc] Motion Detection Window SAD 0 ~ 15 Register            */
} CCAP_T;
/**
    @addtogroup CCAP_CONST CCAP Bit Field Definition
    Constant Definitions for CCAP Controller
@{ */

#define CCAP_CTL_CCAPEN_Pos              (0)                                               /*!< CCAP_T::CTL: CCAPEN Position           */
#define CCAP_CTL_CCAPEN_Msk              (0x1ul << CCAP_CTL_CCAPEN_Pos)                    /*!< CCAP_T::CTL: CCAPEN Mask               */

#define CCAP_CTL_PLNEN_Pos               (5)                                               /*!< CCAP_T::CTL: PLNEN Position            */
#define CCAP_CTL_PLNEN_Msk               (0x1ul << CCAP_CTL_PLNEN_Pos)                     /*!< CCAP_T::CTL: PLNEN Mask                */

#define CCAP_CTL_PKTEN_Pos               (6)                                               /*!< CCAP_T::CTL: PKTEN Position            */
#define CCAP_CTL_PKTEN_Msk               (0x1ul << CCAP_CTL_PKTEN_Pos)                     /*!< CCAP_T::CTL: PKTEN Mask                */

#define CCAP_CTL_MONO_Pos                (7)                                               /*!< CCAP_T::CTL: MONO Position             */
#define CCAP_CTL_MONO_Msk                (0x1ul << CCAP_CTL_MONO_Pos)                      /*!< CCAP_T::CTL: MONO Mask                 */

#define CCAP_CTL_SHUTTER_Pos             (16)                                              /*!< CCAP_T::CTL: SHUTTER Position          */
#define CCAP_CTL_SHUTTER_Msk             (0x1ul << CCAP_CTL_SHUTTER_Pos)                   /*!< CCAP_T::CTL: SHUTTER Mask              */

#define CCAP_CTL_MY4_SWAP_Pos            (17)                                              /*!< CCAP_T::CTL: MY4_SWAP Position         */
#define CCAP_CTL_MY4_SWAP_Msk            (0x1ul << CCAP_CTL_MY4_SWAP_Pos)                  /*!< CCAP_T::CTL: MY4_SWAP Mask             */

#define CCAP_CTL_MY8_MY4_Pos             (18)                                              /*!< CCAP_T::CTL: MY8_MY4 Position          */
#define CCAP_CTL_MY8_MY4_Msk             (0x1ul << CCAP_CTL_MY8_MY4_Pos)                   /*!< CCAP_T::CTL: MY8_MY4 Mask              */

#define CCAP_CTL_Luma_Y_One_Pos          (19)                                              /*!< CCAP_T::CTL: Luma_Y_One Position       */
#define CCAP_CTL_Luma_Y_One_Msk          (0x1ul << CCAP_CTL_Luma_Y_One_Pos)                /*!< CCAP_T::CTL: Luma_Y_One Mask           */

#define CCAP_CTL_UPDATE_Pos              (20)                                              /*!< CCAP_T::CTL: UPDATE Position           */
#define CCAP_CTL_UPDATE_Msk              (0x1ul << CCAP_CTL_UPDATE_Pos)                    /*!< CCAP_T::CTL: UPDATE Mask               */

#define CCAP_CTL_VPRST_Pos               (24)                                              /*!< CCAP_T::CTL: VPRST Position            */
#define CCAP_CTL_VPRST_Msk               (0x1ul << CCAP_CTL_VPRST_Pos)                     /*!< CCAP_T::CTL: VPRST Mask                */

#define CCAP_PAR_INFMT_Pos               (0)                                               /*!< CCAP_T::PAR: INFMT Position            */
#define CCAP_PAR_INFMT_Msk               (0x1ul << CCAP_PAR_INFMT_Pos)                     /*!< CCAP_T::PAR: INFMT Mask                */

