zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/ccap_reg.h
#define CCAP_PAR_SENTYPE_Pos             (1)                                               /*!< CCAP_T::PAR: SENTYPE Position          */
#define CCAP_PAR_SENTYPE_Msk             (0x1ul << CCAP_PAR_SENTYPE_Pos)                   /*!< CCAP_T::PAR: SENTYPE Mask              */

#define CCAP_PAR_INDATORD_Pos            (2)                                               /*!< CCAP_T::PAR: INDATORD Position         */
#define CCAP_PAR_INDATORD_Msk            (0x3ul << CCAP_PAR_INDATORD_Pos)                  /*!< CCAP_T::PAR: INDATORD Mask             */

#define CCAP_PAR_OUTFMT_Pos              (4)                                               /*!< CCAP_T::PAR: OUTFMT Position           */
#define CCAP_PAR_OUTFMT_Msk              (0x3ul << CCAP_PAR_OUTFMT_Pos)                    /*!< CCAP_T::PAR: OUTFMT Mask               */

#define CCAP_PAR_RANGE_Pos               (6)                                               /*!< CCAP_T::PAR: RANGE Position            */
#define CCAP_PAR_RANGE_Msk               (0x1ul << CCAP_PAR_RANGE_Pos)                     /*!< CCAP_T::PAR: RANGE Mask                */

#define CCAP_PAR_PLNFMT_Pos              (7)                                               /*!< CCAP_T::PAR: PLNFMT Position           */
#define CCAP_PAR_PLNFMT_Msk              (0x1ul << CCAP_PAR_PLNFMT_Pos)                    /*!< CCAP_T::PAR: PLNFMT Mask               */

#define CCAP_PAR_PCLKP_Pos               (8)                                               /*!< CCAP_T::PAR: PCLKP Position            */
#define CCAP_PAR_PCLKP_Msk               (0x1ul << CCAP_PAR_PCLKP_Pos)                     /*!< CCAP_T::PAR: PCLKP Mask                */

#define CCAP_PAR_HSP_Pos                 (9)                                               /*!< CCAP_T::PAR: HSP Position              */
#define CCAP_PAR_HSP_Msk                 (0x1ul << CCAP_PAR_HSP_Pos)                       /*!< CCAP_T::PAR: HSP Mask                  */

#define CCAP_PAR_VSP_Pos                 (10)                                              /*!< CCAP_T::PAR: VSP Position              */
#define CCAP_PAR_VSP_Msk                 (0x1ul << CCAP_PAR_VSP_Pos)                       /*!< CCAP_T::PAR: VSP Mask                  */

#define CCAP_PAR_FBB_Pos                 (18)                                              /*!< CCAP_T::PAR: FBB Position              */
#define CCAP_PAR_FBB_Msk                 (0x1ul << CCAP_PAR_FBB_Pos)                       /*!< CCAP_T::PAR: FBB Mask                  */

#define CCAP_INTSTS_VINTF_Pos            (0)                                               /*!< CCAP_T::INTSTS: VINTF Position         */
#define CCAP_INTSTS_VINTF_Msk            (0x1ul << CCAP_INTSTS_VINTF_Pos)                  /*!< CCAP_T::INTSTS: VINTF Mask             */

#define CCAP_INTSTS_MEINTF_Pos           (1)                                               /*!< CCAP_T::INTSTS: MEINTF Position        */
#define CCAP_INTSTS_MEINTF_Msk           (0x1ul << CCAP_INTSTS_MEINTF_Pos)                 /*!< CCAP_T::INTSTS: MEINTF Mask            */

#define CCAP_INTSTS_ADDRMINTF_Pos        (3)                                               /*!< CCAP_T::INTSTS: ADDRMINTF Position     */
#define CCAP_INTSTS_ADDRMINTF_Msk        (0x1ul << CCAP_INTSTS_ADDRMINTF_Pos)              /*!< CCAP_T::INTSTS: ADDRMINTF Mask         */

#define CCAP_INTSTS_MDINTF_Pos           (4)                                               /*!< CCAP_T::INTSTS: MDINTF Position        */
#define CCAP_INTSTS_MDINTF_Msk           (0x3ul << CCAP_INTSTS_MDINTF_Pos)                 /*!< CCAP_T::INTSTS: MDINTF Mask            */

#define CCAP_INTEN_VIEN_Pos              (0)                                               /*!< CCAP_T::INTEN: VIEN Position           */
#define CCAP_INTEN_VIEN_Msk              (0x1ul << CCAP_INTEN_VIEN_Pos)                    /*!< CCAP_T::INTEN: VIEN Mask               */

#define CCAP_INTEN_MEIEN_Pos             (1)                                               /*!< CCAP_T::INTEN: MEIEN Position          */
#define CCAP_INTEN_MEIEN_Msk             (0x1ul << CCAP_INTEN_MEIEN_Pos)                   /*!< CCAP_T::INTEN: MEIEN Mask              */

#define CCAP_INTEN_ADDRMIEN_Pos          (3)                                               /*!< CCAP_T::INTEN: ADDRMIEN Position       */
#define CCAP_INTEN_ADDRMIEN_Msk          (0x1ul << CCAP_INTEN_ADDRMIEN_Pos)                /*!< CCAP_T::INTEN: ADDRMIEN Mask           */

#define CCAP_INTEN_MDIEN_Pos             (4)                                               /*!< CCAP_T::INTEN: MDIEN Position          */
#define CCAP_INTEN_MDIEN_Msk             (0x3ul << CCAP_INTEN_MDIEN_Pos)                   /*!< CCAP_T::INTEN: MDIEN Mask              */

#define CCAP_PARM_INFMTH_Pos             (0)                                               /*!< CCAP_T::PARM: INFMTH Position          */
#define CCAP_PARM_INFMTH_Msk             (0x1ul << CCAP_PARM_INFMTH_Pos)                   /*!< CCAP_T::PARM: INFMTH Mask              */

#define CCAP_PARM_INDATORDH_Pos          (8)                                               /*!< CCAP_T::PARM: INDATORDH Position       */
#define CCAP_PARM_INDATORDH_Msk          (0x1ul << CCAP_PARM_INDATORDH_Pos)                /*!< CCAP_T::PARM: INDATORDH Mask           */

#define CCAP_PARM_OUTFMTH_Pos            (16)                                              /*!< CCAP_T::PARM: OUTFMTH Position         */
#define CCAP_PARM_OUTFMTH_Msk            (0x1ul << CCAP_PARM_OUTFMTH_Pos)                  /*!< CCAP_T::PARM: OUTFMTH Mask             */

#define CCAP_PARM_RGB888OUTORD_Pos       (24)                                              /*!< CCAP_T::PARM: RGB888OUTORD Position    */
#define CCAP_PARM_RGB888OUTORD_Msk       (0x3ul << CCAP_PARM_RGB888OUTORD_Pos)             /*!< CCAP_T::PARM: RGB888OUTORD Mask        */

#define CCAP_CWSP_CWSADDRH_Pos           (0)                                               /*!< CCAP_T::CWSP: CWSADDRH Position        */
#define CCAP_CWSP_CWSADDRH_Msk           (0xffful << CCAP_CWSP_CWSADDRH_Pos)               /*!< CCAP_T::CWSP: CWSADDRH Mask            */

#define CCAP_CWSP_CWSADDRV_Pos           (16)                                              /*!< CCAP_T::CWSP: CWSADDRV Position        */
#define CCAP_CWSP_CWSADDRV_Msk           (0x7fful << CCAP_CWSP_CWSADDRV_Pos)               /*!< CCAP_T::CWSP: CWSADDRV Mask            */

