zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/ccap_reg.h
#define CCAP_CWS_CWW_Pos                 (0)                                               /*!< CCAP_T::CWS: CWW Position              */
#define CCAP_CWS_CWW_Msk                 (0xffful << CCAP_CWS_CWW_Pos)                     /*!< CCAP_T::CWS: CWW Mask                  */

#define CCAP_CWS_CWH_Pos                 (16)                                              /*!< CCAP_T::CWS: CWH Position              */
#define CCAP_CWS_CWH_Msk                 (0x7fful << CCAP_CWS_CWH_Pos)                     /*!< CCAP_T::CWS: CWH Mask                  */

#define CCAP_PKTSL_PKTSHML_Pos           (0)                                               /*!< CCAP_T::PKTSL: PKTSHML Position        */
#define CCAP_PKTSL_PKTSHML_Msk           (0xfful << CCAP_PKTSL_PKTSHML_Pos)                /*!< CCAP_T::PKTSL: PKTSHML Mask            */

#define CCAP_PKTSL_PKTSHNL_Pos           (8)                                               /*!< CCAP_T::PKTSL: PKTSHNL Position        */
#define CCAP_PKTSL_PKTSHNL_Msk           (0xfful << CCAP_PKTSL_PKTSHNL_Pos)                /*!< CCAP_T::PKTSL: PKTSHNL Mask            */

#define CCAP_PKTSL_PKTSVML_Pos           (16)                                              /*!< CCAP_T::PKTSL: PKTSVML Position        */
#define CCAP_PKTSL_PKTSVML_Msk           (0xfful << CCAP_PKTSL_PKTSVML_Pos)                /*!< CCAP_T::PKTSL: PKTSVML Mask            */

#define CCAP_PKTSL_PKTSVNL_Pos           (24)                                              /*!< CCAP_T::PKTSL: PKTSVNL Position        */
#define CCAP_PKTSL_PKTSVNL_Msk           (0xfful << CCAP_PKTSL_PKTSVNL_Pos)                /*!< CCAP_T::PKTSL: PKTSVNL Mask            */

#define CCAP_PLNSL_PLNSHML_Pos           (0)                                               /*!< CCAP_T::PLNSL: PLNSHML Position        */
#define CCAP_PLNSL_PLNSHML_Msk           (0xfful << CCAP_PLNSL_PLNSHML_Pos)                /*!< CCAP_T::PLNSL: PLNSHML Mask            */

#define CCAP_PLNSL_PLNSHNL_Pos           (8)                                               /*!< CCAP_T::PLNSL: PLNSHNL Position        */
#define CCAP_PLNSL_PLNSHNL_Msk           (0xfful << CCAP_PLNSL_PLNSHNL_Pos)                /*!< CCAP_T::PLNSL: PLNSHNL Mask            */

#define CCAP_PLNSL_PLNSVML_Pos           (16)                                              /*!< CCAP_T::PLNSL: PLNSVML Position        */
#define CCAP_PLNSL_PLNSVML_Msk           (0xfful << CCAP_PLNSL_PLNSVML_Pos)                /*!< CCAP_T::PLNSL: PLNSVML Mask            */

#define CCAP_PLNSL_PLNSVNL_Pos           (24)                                              /*!< CCAP_T::PLNSL: PLNSVNL Position        */
#define CCAP_PLNSL_PLNSVNL_Msk           (0xfful << CCAP_PLNSL_PLNSVNL_Pos)                /*!< CCAP_T::PLNSL: PLNSVNL Mask            */

#define CCAP_FRCTL_FRM_Pos               (0)                                               /*!< CCAP_T::FRCTL: FRM Position            */
#define CCAP_FRCTL_FRM_Msk               (0x3ful << CCAP_FRCTL_FRM_Pos)                    /*!< CCAP_T::FRCTL: FRM Mask                */

#define CCAP_FRCTL_FRN_Pos               (8)                                               /*!< CCAP_T::FRCTL: FRN Position            */
#define CCAP_FRCTL_FRN_Msk               (0x3ful << CCAP_FRCTL_FRN_Pos)                    /*!< CCAP_T::FRCTL: FRN Mask                */

#define CCAP_STRIDE_PKTSTRIDE_Pos        (0)                                               /*!< CCAP_T::STRIDE: PKTSTRIDE Position     */
#define CCAP_STRIDE_PKTSTRIDE_Msk        (0x3ffful << CCAP_STRIDE_PKTSTRIDE_Pos)           /*!< CCAP_T::STRIDE: PKTSTRIDE Mask         */

#define CCAP_STRIDE_PLNSTRIDE_Pos        (16)                                              /*!< CCAP_T::STRIDE: PLNSTRIDE Position     */
#define CCAP_STRIDE_PLNSTRIDE_Msk        (0x3ffful << CCAP_STRIDE_PLNSTRIDE_Pos)           /*!< CCAP_T::STRIDE: PLNSTRIDE Mask         */

#define CCAP_FIFOTH_PLNVFTH_Pos          (0)                                               /*!< CCAP_T::FIFOTH: PLNVFTH Position       */
#define CCAP_FIFOTH_PLNVFTH_Msk          (0xful << CCAP_FIFOTH_PLNVFTH_Pos)                /*!< CCAP_T::FIFOTH: PLNVFTH Mask           */

#define CCAP_FIFOTH_PLNUFTH_Pos          (8)                                               /*!< CCAP_T::FIFOTH: PLNUFTH Position       */
#define CCAP_FIFOTH_PLNUFTH_Msk          (0xful << CCAP_FIFOTH_PLNUFTH_Pos)                /*!< CCAP_T::FIFOTH: PLNUFTH Mask           */

#define CCAP_FIFOTH_PLNYFTH_Pos          (16)                                              /*!< CCAP_T::FIFOTH: PLNYFTH Position       */
#define CCAP_FIFOTH_PLNYFTH_Msk          (0x1ful << CCAP_FIFOTH_PLNYFTH_Pos)               /*!< CCAP_T::FIFOTH: PLNYFTH Mask           */

#define CCAP_FIFOTH_PKTFTH_Pos           (24)                                              /*!< CCAP_T::FIFOTH: PKTFTH Position        */
#define CCAP_FIFOTH_PKTFTH_Msk           (0x1ful << CCAP_FIFOTH_PKTFTH_Pos)                /*!< CCAP_T::FIFOTH: PKTFTH Mask            */

#define CCAP_FIFOTH_OVF_Pos              (31)                                              /*!< CCAP_T::FIFOTH: OVF Position           */
#define CCAP_FIFOTH_OVF_Msk              (0x1ul << CCAP_FIFOTH_OVF_Pos)                    /*!< CCAP_T::FIFOTH: OVF Mask               */

#define CCAP_CMPADDR_CMPADDR_Pos         (0)                                               /*!< CCAP_T::CMPADDR: CMPADDR Position      */
#define CCAP_CMPADDR_CMPADDR_Msk         (0xfffffffful << CCAP_CMPADDR_CMPADDR_Pos)        /*!< CCAP_T::CMPADDR: CMPADDR Mask          */

#define CCAP_LUMA_Y1_THD_LUMA_Y1_THRESH_Pos (0)                                            /*!< CCAP_T::LUMA_Y1_THD: LUMA_Y1_THRESH Position*/
#define CCAP_LUMA_Y1_THD_LUMA_Y1_THRESH_Msk (0xfful << CCAP_LUMA_Y1_THD_LUMA_Y1_THRESH_Pos) /*!< CCAP_T::LUMA_Y1_THD: LUMA_Y1_THRESH Mask*/

#define CCAP_PKTSM_PKTSHMH_Pos           (0)                                               /*!< CCAP_T::PKTSM: PKTSHMH Position        */
#define CCAP_PKTSM_PKTSHMH_Msk           (0xfful << CCAP_PKTSM_PKTSHMH_Pos)                /*!< CCAP_T::PKTSM: PKTSHMH Mask            */

