zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/ccap_reg.h
#define CCAP_PKTSM_PKTSHNH_Pos           (8)                                               /*!< CCAP_T::PKTSM: PKTSHNH Position        */
#define CCAP_PKTSM_PKTSHNH_Msk           (0xfful << CCAP_PKTSM_PKTSHNH_Pos)                /*!< CCAP_T::PKTSM: PKTSHNH Mask            */

#define CCAP_PKTSM_PKTSVMH_Pos           (16)                                              /*!< CCAP_T::PKTSM: PKTSVMH Position        */
#define CCAP_PKTSM_PKTSVMH_Msk           (0xfful << CCAP_PKTSM_PKTSVMH_Pos)                /*!< CCAP_T::PKTSM: PKTSVMH Mask            */

#define CCAP_PKTSM_PKTSVNH_Pos           (24)                                              /*!< CCAP_T::PKTSM: PKTSVNH Position        */
#define CCAP_PKTSM_PKTSVNH_Msk           (0xfful << CCAP_PKTSM_PKTSVNH_Pos)                /*!< CCAP_T::PKTSM: PKTSVNH Mask            */

#define CCAP_PLNSM_PLNSHMH_Pos           (0)                                               /*!< CCAP_T::PLNSM: PLNSHMH Position        */
#define CCAP_PLNSM_PLNSHMH_Msk           (0xfful << CCAP_PLNSM_PLNSHMH_Pos)                /*!< CCAP_T::PLNSM: PLNSHMH Mask            */

#define CCAP_PLNSM_PLNSHNH_Pos           (8)                                               /*!< CCAP_T::PLNSM: PLNSHNH Position        */
#define CCAP_PLNSM_PLNSHNH_Msk           (0xfful << CCAP_PLNSM_PLNSHNH_Pos)                /*!< CCAP_T::PLNSM: PLNSHNH Mask            */

#define CCAP_PLNSM_PLNSVMH_Pos           (16)                                              /*!< CCAP_T::PLNSM: PLNSVMH Position        */
#define CCAP_PLNSM_PLNSVMH_Msk           (0xfful << CCAP_PLNSM_PLNSVMH_Pos)                /*!< CCAP_T::PLNSM: PLNSVMH Mask            */

#define CCAP_PLNSM_PLNSVNH_Pos           (24)                                              /*!< CCAP_T::PLNSM: PLNSVNH Position        */
#define CCAP_PLNSM_PLNSVNH_Msk           (0xfful << CCAP_PLNSM_PLNSVNH_Pos)                /*!< CCAP_T::PLNSM: PLNSVNH Mask            */

#define CCAP_CURADDRP_CURADDR_Pos        (0)                                               /*!< CCAP_T::CURADDRP: CURADDR Position     */
#define CCAP_CURADDRP_CURADDR_Msk        (0xfffffffful << CCAP_CURADDRP_CURADDR_Pos)       /*!< CCAP_T::CURADDRP: CURADDR Mask         */

#define CCAP_CURADDRY_CURADDR_Pos        (0)                                               /*!< CCAP_T::CURADDRY: CURADDR Position     */
#define CCAP_CURADDRY_CURADDR_Msk        (0xfffffffful << CCAP_CURADDRY_CURADDR_Pos)       /*!< CCAP_T::CURADDRY: CURADDR Mask         */

#define CCAP_CURADDRU_CURADDR_Pos        (0)                                               /*!< CCAP_T::CURADDRU: CURADDR Position     */
#define CCAP_CURADDRU_CURADDR_Msk        (0xfffffffful << CCAP_CURADDRU_CURADDR_Pos)       /*!< CCAP_T::CURADDRU: CURADDR Mask         */

#define CCAP_CURADDRV_CURADDR_Pos        (0)                                               /*!< CCAP_T::CURADDRV: CURADDR Position     */
#define CCAP_CURADDRV_CURADDR_Msk        (0xfffffffful << CCAP_CURADDRV_CURADDR_Pos)       /*!< CCAP_T::CURADDRV: CURADDR Mask         */

#define CCAP_PKTBA0_BASEADDR_Pos         (0)                                               /*!< CCAP_T::PKTBA0: BASEADDR Position      */
#define CCAP_PKTBA0_BASEADDR_Msk         (0xfffffffful << CCAP_PKTBA0_BASEADDR_Pos)        /*!< CCAP_T::PKTBA0: BASEADDR Mask          */

#define CCAP_YBA_BASEADDR_Pos            (0)                                               /*!< CCAP_T::YBA: BASEADDR Position         */
#define CCAP_YBA_BASEADDR_Msk            (0xfffffffful << CCAP_YBA_BASEADDR_Pos)           /*!< CCAP_T::YBA: BASEADDR Mask             */

#define CCAP_UBA_BASEADDR_Pos            (0)                                               /*!< CCAP_T::UBA: BASEADDR Position         */
#define CCAP_UBA_BASEADDR_Msk            (0xfffffffful << CCAP_UBA_BASEADDR_Pos)           /*!< CCAP_T::UBA: BASEADDR Mask             */

#define CCAP_VBA_BASEADDR_Pos            (0)                                               /*!< CCAP_T::VBA: BASEADDR Position         */
#define CCAP_VBA_BASEADDR_Msk            (0xfffffffful << CCAP_VBA_BASEADDR_Pos)           /*!< CCAP_T::VBA: BASEADDR Mask             */

#define CCAP_MDCTL_WEN0_Pos              (0)                                               /*!< CCAP_T::MDCTL: WEN0 Position           */
#define CCAP_MDCTL_WEN0_Msk              (0x1ul << CCAP_MDCTL_WEN0_Pos)                    /*!< CCAP_T::MDCTL: WEN0 Mask               */

#define CCAP_MDCTL_WEN1_Pos              (1)                                               /*!< CCAP_T::MDCTL: WEN1 Position           */
#define CCAP_MDCTL_WEN1_Msk              (0x1ul << CCAP_MDCTL_WEN1_Pos)                    /*!< CCAP_T::MDCTL: WEN1 Mask               */

#define CCAP_MDCTL_WEN2_Pos              (2)                                               /*!< CCAP_T::MDCTL: WEN2 Position           */
#define CCAP_MDCTL_WEN2_Msk              (0x1ul << CCAP_MDCTL_WEN2_Pos)                    /*!< CCAP_T::MDCTL: WEN2 Mask               */

#define CCAP_MDCTL_WEN3_Pos              (3)                                               /*!< CCAP_T::MDCTL: WEN3 Position           */
#define CCAP_MDCTL_WEN3_Msk              (0x1ul << CCAP_MDCTL_WEN3_Pos)                    /*!< CCAP_T::MDCTL: WEN3 Mask               */

#define CCAP_MDCTL_WEN4_Pos              (4)                                               /*!< CCAP_T::MDCTL: WEN4 Position           */
#define CCAP_MDCTL_WEN4_Msk              (0x1ul << CCAP_MDCTL_WEN4_Pos)                    /*!< CCAP_T::MDCTL: WEN4 Mask               */

#define CCAP_MDCTL_WEN5_Pos              (5)                                               /*!< CCAP_T::MDCTL: WEN5 Position           */
#define CCAP_MDCTL_WEN5_Msk              (0x1ul << CCAP_MDCTL_WEN5_Pos)                    /*!< CCAP_T::MDCTL: WEN5 Mask               */

#define CCAP_MDCTL_WEN6_Pos              (6)                                               /*!< CCAP_T::MDCTL: WEN6 Position           */
#define CCAP_MDCTL_WEN6_Msk              (0x1ul << CCAP_MDCTL_WEN6_Pos)                    /*!< CCAP_T::MDCTL: WEN6 Mask               */

