zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/ccap_reg.h
#define CCAP_MDCTL_WEN7_Pos              (7)                                               /*!< CCAP_T::MDCTL: WEN7 Position           */
#define CCAP_MDCTL_WEN7_Msk              (0x1ul << CCAP_MDCTL_WEN7_Pos)                    /*!< CCAP_T::MDCTL: WEN7 Mask               */

#define CCAP_MDCTL_WEN8_Pos              (8)                                               /*!< CCAP_T::MDCTL: WEN8 Position           */
#define CCAP_MDCTL_WEN8_Msk              (0x1ul << CCAP_MDCTL_WEN8_Pos)                    /*!< CCAP_T::MDCTL: WEN8 Mask               */

#define CCAP_MDCTL_WEN9_Pos              (9)                                               /*!< CCAP_T::MDCTL: WEN9 Position           */
#define CCAP_MDCTL_WEN9_Msk              (0x1ul << CCAP_MDCTL_WEN9_Pos)                    /*!< CCAP_T::MDCTL: WEN9 Mask               */

#define CCAP_MDCTL_WEN10_Pos             (10)                                              /*!< CCAP_T::MDCTL: WEN10 Position          */
#define CCAP_MDCTL_WEN10_Msk             (0x1ul << CCAP_MDCTL_WEN10_Pos)                   /*!< CCAP_T::MDCTL: WEN10 Mask              */

#define CCAP_MDCTL_WEN11_Pos             (11)                                              /*!< CCAP_T::MDCTL: WEN11 Position          */
#define CCAP_MDCTL_WEN11_Msk             (0x1ul << CCAP_MDCTL_WEN11_Pos)                   /*!< CCAP_T::MDCTL: WEN11 Mask              */

#define CCAP_MDCTL_WEN12_Pos             (12)                                              /*!< CCAP_T::MDCTL: WEN12 Position          */
#define CCAP_MDCTL_WEN12_Msk             (0x1ul << CCAP_MDCTL_WEN12_Pos)                   /*!< CCAP_T::MDCTL: WEN12 Mask              */

#define CCAP_MDCTL_WEN13_Pos             (13)                                              /*!< CCAP_T::MDCTL: WEN13 Position          */
#define CCAP_MDCTL_WEN13_Msk             (0x1ul << CCAP_MDCTL_WEN13_Pos)                   /*!< CCAP_T::MDCTL: WEN13 Mask              */

#define CCAP_MDCTL_WEN14_Pos             (14)                                              /*!< CCAP_T::MDCTL: WEN14 Position          */
#define CCAP_MDCTL_WEN14_Msk             (0x1ul << CCAP_MDCTL_WEN14_Pos)                   /*!< CCAP_T::MDCTL: WEN14 Mask              */

#define CCAP_MDCTL_WEN15_Pos             (15)                                              /*!< CCAP_T::MDCTL: WEN15 Position          */
#define CCAP_MDCTL_WEN15_Msk             (0x1ul << CCAP_MDCTL_WEN15_Pos)                   /*!< CCAP_T::MDCTL: WEN15 Mask              */

#define CCAP_MDTRG_WK_TRGSEL_Pos         (0)                                               /*!< CCAP_T::MDTRG_WK: TRGSEL Position      */
#define CCAP_MDTRG_WK_TRGSEL_Msk         (0x3ul << CCAP_MDTRG_WK_TRGSEL_Pos)               /*!< CCAP_T::MDTRG_WK: TRGSEL Mask          */

#define CCAP_MDTRG_WK_WKEN_Pos           (16)                                              /*!< CCAP_T::MDTRG_WK: WKEN Position        */
#define CCAP_MDTRG_WK_WKEN_Msk           (0x1ul << CCAP_MDTRG_WK_WKEN_Pos)                 /*!< CCAP_T::MDTRG_WK: WKEN Mask            */

#define CCAP_MDTRG_WK_WKF_Pos            (24)                                              /*!< CCAP_T::MDTRG_WK: WKF Position         */
#define CCAP_MDTRG_WK_WKF_Msk            (0x1ul << CCAP_MDTRG_WK_WKF_Pos)                  /*!< CCAP_T::MDTRG_WK: WKF Mask             */

#define CCAP_MDTTH_MDTTH_Pos             (0)                                               /*!< CCAP_T::MDTTH: MDTTH Position          */
#define CCAP_MDTTH_MDTTH_Msk             (0x1ffffful << CCAP_MDTTH_MDTTH_Pos)              /*!< CCAP_T::MDTTH: MDTTH Mask              */

#define CCAP_MDTSAD_MDTSAD_Pos           (0)                                               /*!< CCAP_T::MDTSAD: MDTSAD Position        */
#define CCAP_MDTSAD_MDTSAD_Msk           (0x1ffffful << CCAP_MDTSAD_MDTSAD_Pos)            /*!< CCAP_T::MDTSAD: MDTSAD Mask            */

#define CCAP_MDWOCTH_MDWOCTH_Pos         (0)                                               /*!< CCAP_T::MDWOCTH: MDWOCTH Position      */
#define CCAP_MDWOCTH_MDWOCTH_Msk         (0xful << CCAP_MDWOCTH_MDWOCTH_Pos)               /*!< CCAP_T::MDWOCTH: MDWOCTH Mask          */

#define CCAP_MDWOC_MDWOC_Pos             (0)                                               /*!< CCAP_T::MDWOC: MDWOC Position          */
#define CCAP_MDWOC_MDWOC_Msk             (0x1ful << CCAP_MDWOC_MDWOC_Pos)                  /*!< CCAP_T::MDWOC: MDWOC Mask              */

#define CCAP_MDWTH0_MDWTH_Pos            (0)                                               /*!< CCAP_T::MDWTH0: MDWTH Position         */
#define CCAP_MDWTH0_MDWTH_Msk            (0x1fffful << CCAP_MDWTH0_MDWTH_Pos)              /*!< CCAP_T::MDWTH0: MDWTH Mask             */

#define CCAP_MDWTH1_MDWTH_Pos            (0)                                               /*!< CCAP_T::MDWTH1: MDWTH Position         */
#define CCAP_MDWTH1_MDWTH_Msk            (0x1fffful << CCAP_MDWTH1_MDWTH_Pos)              /*!< CCAP_T::MDWTH1: MDWTH Mask             */

#define CCAP_MDWTH2_MDWTH_Pos            (0)                                               /*!< CCAP_T::MDWTH2: MDWTH Position         */
#define CCAP_MDWTH2_MDWTH_Msk            (0x1fffful << CCAP_MDWTH2_MDWTH_Pos)              /*!< CCAP_T::MDWTH2: MDWTH Mask             */

#define CCAP_MDWTH3_MDWTH_Pos            (0)                                               /*!< CCAP_T::MDWTH3: MDWTH Position         */
#define CCAP_MDWTH3_MDWTH_Msk            (0x1fffful << CCAP_MDWTH3_MDWTH_Pos)              /*!< CCAP_T::MDWTH3: MDWTH Mask             */

#define CCAP_MDWTH4_MDWTH_Pos            (0)                                               /*!< CCAP_T::MDWTH4: MDWTH Position         */
#define CCAP_MDWTH4_MDWTH_Msk            (0x1fffful << CCAP_MDWTH4_MDWTH_Pos)              /*!< CCAP_T::MDWTH4: MDWTH Mask             */

#define CCAP_MDWTH5_MDWTH_Pos            (0)                                               /*!< CCAP_T::MDWTH5: MDWTH Position         */
#define CCAP_MDWTH5_MDWTH_Msk            (0x1fffful << CCAP_MDWTH5_MDWTH_Pos)              /*!< CCAP_T::MDWTH5: MDWTH Mask             */

#define CCAP_MDWTH6_MDWTH_Pos            (0)                                               /*!< CCAP_T::MDWTH6: MDWTH Position         */
#define CCAP_MDWTH6_MDWTH_Msk            (0x1fffful << CCAP_MDWTH6_MDWTH_Pos)              /*!< CCAP_T::MDWTH6: MDWTH Mask             */

