zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/ccap_reg.h
#define CCAP_MDWTH7_MDWTH_Pos            (0)                                               /*!< CCAP_T::MDWTH7: MDWTH Position         */
#define CCAP_MDWTH7_MDWTH_Msk            (0x1fffful << CCAP_MDWTH7_MDWTH_Pos)              /*!< CCAP_T::MDWTH7: MDWTH Mask             */

#define CCAP_MDWTH8_MDWTH_Pos            (0)                                               /*!< CCAP_T::MDWTH8: MDWTH Position         */
#define CCAP_MDWTH8_MDWTH_Msk            (0x1fffful << CCAP_MDWTH8_MDWTH_Pos)              /*!< CCAP_T::MDWTH8: MDWTH Mask             */

#define CCAP_MDWTH9_MDWTH_Pos            (0)                                               /*!< CCAP_T::MDWTH9: MDWTH Position         */
#define CCAP_MDWTH9_MDWTH_Msk            (0x1fffful << CCAP_MDWTH9_MDWTH_Pos)              /*!< CCAP_T::MDWTH9: MDWTH Mask             */

#define CCAP_MDWTH10_MDWTH_Pos           (0)                                               /*!< CCAP_T::MDWTH10: MDWTH Position        */
#define CCAP_MDWTH10_MDWTH_Msk           (0x1fffful << CCAP_MDWTH10_MDWTH_Pos)             /*!< CCAP_T::MDWTH10: MDWTH Mask            */

#define CCAP_MDWTH11_MDWTH_Pos           (0)                                               /*!< CCAP_T::MDWTH11: MDWTH Position        */
#define CCAP_MDWTH11_MDWTH_Msk           (0x1fffful << CCAP_MDWTH11_MDWTH_Pos)             /*!< CCAP_T::MDWTH11: MDWTH Mask            */

#define CCAP_MDWTH12_MDWTH_Pos           (0)                                               /*!< CCAP_T::MDWTH12: MDWTH Position        */
#define CCAP_MDWTH12_MDWTH_Msk           (0x1fffful << CCAP_MDWTH12_MDWTH_Pos)             /*!< CCAP_T::MDWTH12: MDWTH Mask            */

#define CCAP_MDWTH13_MDWTH_Pos           (0)                                               /*!< CCAP_T::MDWTH13: MDWTH Position        */
#define CCAP_MDWTH13_MDWTH_Msk           (0x1fffful << CCAP_MDWTH13_MDWTH_Pos)             /*!< CCAP_T::MDWTH13: MDWTH Mask            */

#define CCAP_MDWTH14_MDWTH_Pos           (0)                                               /*!< CCAP_T::MDWTH14: MDWTH Position        */
#define CCAP_MDWTH14_MDWTH_Msk           (0x1fffful << CCAP_MDWTH14_MDWTH_Pos)             /*!< CCAP_T::MDWTH14: MDWTH Mask            */

#define CCAP_MDWTH15_MDWTH_Pos           (0)                                               /*!< CCAP_T::MDWTH15: MDWTH Position        */
#define CCAP_MDWTH15_MDWTH_Msk           (0x1fffful << CCAP_MDWTH15_MDWTH_Pos)             /*!< CCAP_T::MDWTH15: MDWTH Mask            */

#define CCAP_MDWSAD0_MDWSAD_Pos          (0)                                               /*!< CCAP_T::MDWSAD0: MDWSAD Position       */
#define CCAP_MDWSAD0_MDWSAD_Msk          (0x1fffful << CCAP_MDWSAD0_MDWSAD_Pos)            /*!< CCAP_T::MDWSAD0: MDWSAD Mask           */

#define CCAP_MDWSAD1_MDWSAD_Pos          (0)                                               /*!< CCAP_T::MDWSAD1: MDWSAD Position       */
#define CCAP_MDWSAD1_MDWSAD_Msk          (0x1fffful << CCAP_MDWSAD1_MDWSAD_Pos)            /*!< CCAP_T::MDWSAD1: MDWSAD Mask           */

#define CCAP_MDWSAD2_MDWSAD_Pos          (0)                                               /*!< CCAP_T::MDWSAD2: MDWSAD Position       */
#define CCAP_MDWSAD2_MDWSAD_Msk          (0x1fffful << CCAP_MDWSAD2_MDWSAD_Pos)            /*!< CCAP_T::MDWSAD2: MDWSAD Mask           */

#define CCAP_MDWSAD3_MDWSAD_Pos          (0)                                               /*!< CCAP_T::MDWSAD3: MDWSAD Position       */
#define CCAP_MDWSAD3_MDWSAD_Msk          (0x1fffful << CCAP_MDWSAD3_MDWSAD_Pos)            /*!< CCAP_T::MDWSAD3: MDWSAD Mask           */

#define CCAP_MDWSAD4_MDWSAD_Pos          (0)                                               /*!< CCAP_T::MDWSAD4: MDWSAD Position       */
#define CCAP_MDWSAD4_MDWSAD_Msk          (0x1fffful << CCAP_MDWSAD4_MDWSAD_Pos)            /*!< CCAP_T::MDWSAD4: MDWSAD Mask           */

#define CCAP_MDWSAD5_MDWSAD_Pos          (0)                                               /*!< CCAP_T::MDWSAD5: MDWSAD Position       */
#define CCAP_MDWSAD5_MDWSAD_Msk          (0x1fffful << CCAP_MDWSAD5_MDWSAD_Pos)            /*!< CCAP_T::MDWSAD5: MDWSAD Mask           */

#define CCAP_MDWSAD6_MDWSAD_Pos          (0)                                               /*!< CCAP_T::MDWSAD6: MDWSAD Position       */
#define CCAP_MDWSAD6_MDWSAD_Msk          (0x1fffful << CCAP_MDWSAD6_MDWSAD_Pos)            /*!< CCAP_T::MDWSAD6: MDWSAD Mask           */

#define CCAP_MDWSAD7_MDWSAD_Pos          (0)                                               /*!< CCAP_T::MDWSAD7: MDWSAD Position       */
#define CCAP_MDWSAD7_MDWSAD_Msk          (0x1fffful << CCAP_MDWSAD7_MDWSAD_Pos)            /*!< CCAP_T::MDWSAD7: MDWSAD Mask           */

#define CCAP_MDWSAD8_MDWSAD_Pos          (0)                                               /*!< CCAP_T::MDWSAD8: MDWSAD Position       */
#define CCAP_MDWSAD8_MDWSAD_Msk          (0x1fffful << CCAP_MDWSAD8_MDWSAD_Pos)            /*!< CCAP_T::MDWSAD8: MDWSAD Mask           */

#define CCAP_MDWSAD9_MDWSAD_Pos          (0)                                               /*!< CCAP_T::MDWSAD9: MDWSAD Position       */
#define CCAP_MDWSAD9_MDWSAD_Msk          (0x1fffful << CCAP_MDWSAD9_MDWSAD_Pos)            /*!< CCAP_T::MDWSAD9: MDWSAD Mask           */

#define CCAP_MDWSAD10_MDWSAD_Pos         (0)                                               /*!< CCAP_T::MDWSAD10: MDWSAD Position      */
#define CCAP_MDWSAD10_MDWSAD_Msk         (0x1fffful << CCAP_MDWSAD10_MDWSAD_Pos)           /*!< CCAP_T::MDWSAD10: MDWSAD Mask          */

#define CCAP_MDWSAD11_MDWSAD_Pos         (0)                                               /*!< CCAP_T::MDWSAD11: MDWSAD Position      */
#define CCAP_MDWSAD11_MDWSAD_Msk         (0x1fffful << CCAP_MDWSAD11_MDWSAD_Pos)           /*!< CCAP_T::MDWSAD11: MDWSAD Mask          */

#define CCAP_MDWSAD12_MDWSAD_Pos         (0)                                               /*!< CCAP_T::MDWSAD12: MDWSAD Position      */
#define CCAP_MDWSAD12_MDWSAD_Msk         (0x1fffful << CCAP_MDWSAD12_MDWSAD_Pos)           /*!< CCAP_T::MDWSAD12: MDWSAD Mask          */

#define CCAP_MDWSAD13_MDWSAD_Pos         (0)                                               /*!< CCAP_T::MDWSAD13: MDWSAD Position      */
#define CCAP_MDWSAD13_MDWSAD_Msk         (0x1fffful << CCAP_MDWSAD13_MDWSAD_Pos)           /*!< CCAP_T::MDWSAD13: MDWSAD Mask          */

#define CCAP_MDWSAD14_MDWSAD_Pos         (0)                                               /*!< CCAP_T::MDWSAD14: MDWSAD Position      */
#define CCAP_MDWSAD14_MDWSAD_Msk         (0x1fffful << CCAP_MDWSAD14_MDWSAD_Pos)           /*!< CCAP_T::MDWSAD14: MDWSAD Mask          */

#define CCAP_MDWSAD15_MDWSAD_Pos         (0)                                               /*!< CCAP_T::MDWSAD15: MDWSAD Position      */
#define CCAP_MDWSAD15_MDWSAD_Msk         (0x1fffful << CCAP_MDWSAD15_MDWSAD_Pos)           /*!< CCAP_T::MDWSAD15: MDWSAD Mask          */

/** @} CCAP_CONST */
/** @} end of CCAP register group */
/** @} end of REGISTER group */

#if defined ( __CC_ARM   )
    #pragma no_anon_unions
#endif

#endif /* __CCAP_REG_H__ */
